{
  "episode_id": "6752ee08-7593-4f93-a4b4-1a74e313d3ea",
  "tl_dr": "The author says the art of spending money is a psychological exercise. He says it is an easy assumption to make if you're unhappy with your life. Morgan: 'I think we intuitively think nothing needs to be said because the answer should be obvious' The correlation between how much you spend and how happy you are, it can exist, he says. The author says there are literally tens of thousands of books on how to invest.",
  "bullets": [
    "Morgan Housel is the legendary financial guru. Revealing that everything we've been told about saving and spending money could be our biggest downfall. If you're unhappy with your life, it is a very easy assumption to make that if you had more money, a bigger house, a better car, or whatever it might be.",
    "So much of spending is a psychological niche that you're trying to scratch, and that manifests in so many different ways. So is it wrong to buy a Rolex? Absolutely not. But when it's controlling your personality, it's no different than any other addiction, where it's forcing you to do things that you otherwise don't want to do.",
    "The first thing that I think is most important is... I see messages all the time in the comments section that some of you didn't realize you don't subscribe. So if you could do me a favor and double check if you're a subscriber to this channel, that would be tremendously appreciated.",
    "Morgan: I've never heard anybody emphasize the importance of spending money. Morgan: Why would someone like you who sells tens of millions of copies of their books commit themselves to writing a book about the art of spending? Morgan: You could have written anything that you wanted to and it would have been a success.",
    "Morgan Freeman has written about money and finance and investing for 20 years. He says there are literally tens of thousands of books on how to invest, how to grow your money and how to get rich. But there is virtually no book out there written about spending money, he says. Morgan: 'I think we intuitively think nothing needs to be said because the answer should be obvious'",
    "The correlation between how much you spend and how happy you are, it can exist. Everyone can spend money in a way that's going to make them happier, but it is not as simple as you think. So to look at the psychology of greed and envy and social aspiration and like climbing the social ladder, whether those people are paying any attention to you.",
    "The author says the art of spending money is a psychological exercise. He says it is an easy assumption to make if you're unhappy with your life. \"It's just easier to assume that that's true than it actually is,\" he says. \"I guarantee you that every single person listening to this right now has some degree of that\"",
    "\"Money is a very clear window that if you see how somebody engages with money, you're like, oh, I understand your insecurities,\" he says. \"Even if they don't necessarily know it or not. So much of spending is a psychological exercise. There's an itch that you're trying to scratch\"",
    "There's a great financial writer named Tiffany Allishe. She's, she grew up very, very poor. And now she's extremely successful. And she calls it post-traumatic broke syndrome. Even though she has a lot of money right now, she's afraid to spend it because she's, the feeling in her head is, I will never go back to that.",
    "\"There's a social signaling that you're signaling to others. You're sending it to yourself, to trophy for yourself of what you've overcome,\" he says. \"If I was on a deserted island with maybe just, just me and in my family, nobody could see how we were living\""
  ]
}