{
  "episode_id": "80f94e24-0124-4fea-bfed-460c9dd68908",
  "tl_dr": "CNN's John Berman talks to his sons Barron and Don. Don is a hunter and knows everything about that world and guns. Barron plays golf and different sports soccer. He's a Dustin Poirier fan. He likes Dana White, he's, he doesn't waste words. He has a, seems like a strong sense of integrity for himself. He will be in Las Vegas, Nevada over Labor Day weekend.",
  "bullets": [
    "I have some tour dates to tell you about. I'll be in Las Vegas, Nevada over Labor Day weekend. If you're going to be there, then I will too. All tickets through TheoVon.com slash T-O-U-R and thank you so much for your support.",
    "Donald Trump is currently running for president on the Republican ticket. We sat down at his club in Bedminster, New Jersey, and we want to thank the crew there for helping us make the production happen. He's one of the most famous people on earth, and I'm grateful for this chance to learn more about him.",
    "CNN's John Berman talks to his sons Barron and Don. Don is a hunter and knows everything about that world and guns. Barron plays golf and different sports soccer. He's a good athlete, Barron. And he's getting set to go in the fall to a good college, a very good one.",
    "Eric and Eric's grandfather would take them hunting in Czechoslovakia. Eric was the one that said, dad, boy, you got lucky because I didn't realize that 130 yards is actually very close in that parlance. And Eric, likewise, he loves the business. He loves real estate. Also, very much of a hunter and understands a lot of things about that.",
    "Don and Eric have a good sense of humor. They get along great with the rest of the family. And but I love you. I see you talk about a great guy. And that's Don, and that's Eric. Yeah, they're funny. And they're good, they's good guys. They got to love it.",
    "I like Dana White, he's, he doesn't waste words. He likes to, I think, be efficient. And he likes, he has a, seems like a strong sense of integrity for himself. Nobody could do what he does. And it's interesting. And we go there and we enjoy it.",
    "UFC became my favorite sport during the pandemic because Dana was brave enough to stay open. He was the whole ball game. He'd open up in arenas with nothing other than very good fighters. There it is right there. See, look, there you are. And I'm right behind you there.",
    "I'm a Dustin Poirier fan. Oh, he's great. He was a boy. He's from Louisiana. That last fight he had, whether you like it or not, he is a warrior. As that fight went along, he just got stronger and stronger. And he was going to be choked out about four different times.",
    "It was Joe Frazier, Muhammad Ali in Madison Square Garden, many, many years ago. And I think that was the first fight I went to. I liked, I was like the boxing. Muhammad became a friend of mine. So did Joe or Jolt and Joe. He was, they were two great fighters.",
    "I remember that Muhammad wasn't allowed to fight because of lots of different things. And they finally made that happen. And the fight was so unbelievable. Two undefeated heavyweight champions of the world. I think they had like many heart attacks that night, literally heart attacks in Madison Square Garden. It was a long time ago, but you would never forget it."
  ]
}