{
  "episode_id": "G_Herbo_On_Lil_Herb_King_Von_Chief_Keef_Nicki_Minaj_Juice_WRLD_Marriage_by_Club_Shay_Shay",
  "tl_dr": "G. Herbal Man is an undeniable and influential talent. He's admired as one of the most beloved family member in rap a loving father a.k.a. Little Herb. He says his brother used to tell him dream is a gift that we give to ourselves. He never wanted to be anything other than the basketball playing a rapper. Would you trade your career your rap career to be in the NBA? No, no.",
  "bullets": [
    "G. Herbal Man is an undeniable and influential talent. He's admired as one of the most beloved family member in rap a loving father a.k.a. Little Herb. Let's let'sLet's toast over this old shade See what you think about this year. I can't wait.",
    "Little Herb is a Kid from the east side of Chicago one of the most poverty-stricken dangerous neighborhoods in Chicago. Being shot at 16 and seeing a lot of my homies pass away Like little heard was just a kid with a dream and you know, I'm saying fast forward me being G. Herbal is like I Had to kind of like tap back into my old self.",
    "G. Herbal is like I had to kind of like tap back into my old self and find that hunger for real So that's why I really like I'm on a little herd way right now. What's some of your finest memories your childhood memories? Going to play basketball at Echo South Park playing basketball at South Shore Park.",
    "Rapper says his finest memories are of being able to walk 12 blocks to go play basketball. He says his brother used to tell him dream is a gift that we give to ourselves. Outside of rap did you dream of anything else other than rap or that was that you know? You want to yeah, I wanted to go D1 and go to college.",
    "I wanted to go D1 and go Everybody like and I wasn't like when I was young. I didn't really get good at basketball until I got like eighth grade ninth grade Okay, like I just had a dream I wanted to do it because it was the cool thing to do right my big cousins and big brother and all and play basketball.",
    "I never wanted to be anything other than the basketball playing a rapper. Did you play any other sports you try football you try I ain't I never tried football man. I just like I just fell a little basketball and just only played basketball like I wasn't athletic at all. Who would you compare your basketball game to you you LeBron?",
    "Coming from Chicago D Rose homegrown. It's like we seen it Like I used to watch him play when he went to Beasley. I knew who Derek Rose was Oh, I'm saying from Beasley to Simeon. You feel me? Yes That's why I felt like it just made it like any kid from Chicago they dream like you could do it.",
    "D Rose is one of the greatest point guards to ever play in the NBA. He just gave us so much hope in Chicago, you know, I'm saying from Beasley to Simeon. That's why I felt like it just made it like any kid from Chicago they dream like you could do it.",
    "Derek Rose is a phenomenal player, but I still think we were robbed of him at his absolute price Absolutely, we definitely got robbed of Derek Rose. He would have had a dynasty around him for real for it. Every you can't tell nobody in Chicago that Derek Rose is not top three point guard ever.",
    "What is the common thread? What is the fabric that tie these together? I think it's just like the cool it factor you know I'm saying like the lifestyle that Rappers their artists live is like it's glamorized. It's looked upon as like fun and athletes Really like they life is disciplined structure."
  ]
}